Documents/ИнформационныйЛистДляГолосования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ИнформационныйЛистДляГолосования</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресПроведенияГолосования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВопросГолосования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТемыГолосования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеобходимоГолосовЗА</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаГолосование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаГолосования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФормыГолосования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШапкаИнформационногоБюлетня</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УчастникиГолосования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственныйВладелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактнаяИнформация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ИнформационныйЛистДляГолосования/Ext/ManagerModule.bsl
Процедура Печать(МассивОбъектов,
				 ПараметрыПечати,
				 КоллекцияПечатныхФорм,
				 ОбъектыПечати,
				 ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МакетПечатьВопросовНаГолосование") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "МакетПечатьВопросовНаГолосование", "ИнформационныйЛистДляГолосования", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "МакетПечатьВопросовНаГолосование"));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МакетПечатьОбъявления") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "МакетПечатьОбъявления", "ИнформационныйЛистДляГолосования", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "МакетПечатьОбъявления"));
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МакетПечатьПротоколаГолосования") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "МакетПечатьПротоколаГолосования", "ИнформационныйЛистДляГолосования", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "МакетПечатьПротоколаГолосования"));
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ИнформационныйЛистДляГолосования";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если ИмяМакета = "МакетПечатьВопросовНаГолосование" Тогда
			
			Для Каждого СтрокаУчасниковГолосования Из ТекущийДокумент.УчастникиГолосования Цикл
				
				Макет = ПолучитьМакет("МакетПечатьВопросовНаГолосование");
				
				//Печать область Шапка
				ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
				ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьШапка, ТекущийДокумент.Ссылка);
				ОбластьШапка.Параметры.Дата = ТекущийДокумент.Дата;
				ОбластьШапка.Параметры.МестоГолосования = ТекущийДокумент.АдресПроведенияГолосования;
				ОбластьШапка.Параметры.ФормаГолосования = ТекущийДокумент.ФормаГолосования;
				ОбластьШапка.Параметры.НомерБюлетеня = СтрокаУчасниковГолосования.НомерСтроки;
				ТабличныйДокумент.Вывести(ОбластьШапка);
				
				//Печать область ОтветственныйЗаГолосование 
				Если ТекущийДокумент.ФормаГолосования = Справочники.ФормыГолосования.ОткрытоеСобрание Тогда
					ОбластьОтветственныйЗаГолосование = Макет.ПолучитьОбласть("ОтветственныйЗаГолосование");
					ОбластьОтветственныйЗаГолосование.Параметры.Ответственный = ТекущийДокумент.ОтветственныйЗаГолосование;
					ТабличныйДокумент.Вывести(ОбластьОтветственныйЗаГолосование);
				КонецЕсли;
				
				//Печать область УчасникГолосования
				ОбластьУчасникГолосования = Макет.ПолучитьОбласть("УчасникГолосования");
				Если НЕ ТекущийДокумент.ФормаГолосования = Справочники.ФормыГолосования.Тайное Тогда
				    ОбластьУчасникГолосования.Параметры.ОтветственныйВладелец = СтрокаУчасниковГолосования.ОтветственныйВладелец;
					ОбластьУчасникГолосования.Параметры.ЛицевойСчет = СтрокаУчасниковГолосования.ЛицевойСчет;
					ОбластьУчасникГолосования.Параметры.ОбъектЛицевогоСчета = СтрокаУчасниковГолосования.ЛицевойСчет.ОбъектЛицевогоСчета;
					ОбластьУчасникГолосования.Параметры.КонтактнаяИнформация = СтрокаУчасниковГолосования.КонтактнаяИнформация;
					ТабличныйДокумент.Вывести(ОбластьУчасникГолосования);
				КонецЕсли; 
				
				//Печать область Вопрос
				ОбластьВопрос = Макет.ПолучитьОбласть("Вопрос");
				ОбластьВопрос.Параметры.ВопросГолосования = ТекущийДокумент.ВопросГолосования;
				ТабличныйДокумент.Вывести(ОбластьВопрос);
				
				//Печать область Разделитель
				ОбластьРазделитель = Макет.ПолучитьОбласть("Разделитель");
				ТабличныйДокумент.Вывести(ОбластьРазделитель);
				
			КонецЦикла;
			
		ИначеЕсли ИмяМакета = "МакетПечатьОбъявления" Тогда            
			
			Макет = ПолучитьМакет("МакетПечатьОбъявления");
				
			//Печать область Шапка
			ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
			ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьШапка, ТекущийДокумент.Ссылка);
			ОбластьШапка.Параметры.Дата = Формат(ТекущийДокумент.Дата,"ДЛФ=DD");
			ОбластьШапка.Параметры.Время = Формат(ТекущийДокумент.Дата,"ДФ=HH:mm");
			ОбластьШапка.Параметры.АдресПроведенияГолосования = ТекущийДокумент.АдресПроведенияГолосования;
			ОбластьШапка.Параметры.ВопросГолосования = ТекущийДокумент.ВопросГолосования;
			ОбластьШапка.Параметры.Здание = ТекущийДокумент.Здание;
			ТабличныйДокумент.Вывести(ОбластьШапка);
			
			//Печать область Шапка Бюлетня
			Если НЕ ПустаяСтрока(ТекущийДокумент.ШапкаИнформационногоБюлетня) Тогда
				ОбластьШапкаБюлетня = Макет.ПолучитьОбласть("ШапкаБюлетня");
				ОбластьШапкаБюлетня.Параметры.ШапкаИнформационногоБюлетня = ТекущийДокумент.ШапкаИнформационногоБюлетня;
				ТабличныйДокумент.Вывести(ОбластьШапкаБюлетня);
			КонецЕсли;
			
			//Печать Область Шапка2
			ОбластьШапка2 = Макет.ПолучитьОбласть("Шапка2");
			ТабличныйДокумент.Вывести(ОбластьШапка2);
			
			//Печать область Строка
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			Для Каждого СтрокаУчасниковГолосования Из ТекущийДокумент.УчастникиГолосования Цикл
				ОбластьСтрока.Параметры.ОтветственныйВладелец = СтрокаУчасниковГолосования.ОтветственныйВладелец;
				ОбластьСтрока.Параметры.ЛицевойСчет = СтрокаУчасниковГолосования.ЛицевойСчет;
				ОбластьСтрока.Параметры.ОбъектЛицевогоСчета = СтрокаУчасниковГолосования.ЛицевойСчет.ОбъектЛицевогоСчета;
				ТабличныйДокумент.Вывести(ОбластьСтрока);
			КонецЦикла;
			
			//Печать область Подвал
			ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
			ТабличныйДокумент.Вывести(ОбластьПодвал);
			
		ИначеЕсли ИмяМакета = "МакетПечатьПротоколаГолосования" Тогда                           
			
			Макет = ПолучитьМакет("МакетПечатьПротоколаГолосования");
				
			//Печать область Шапка
			ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
			ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьШапка, ТекущийДокумент.Ссылка);
			ОбластьШапка.Параметры.Дата = Формат(ТекущийДокумент.Дата,"ДЛФ=DD");
			ОбластьШапка.Параметры.Время = Формат(ТекущийДокумент.Дата,"ДФ=HH:mm");
			ОбластьШапка.Параметры.АдресПроведенияГолосования = ТекущийДокумент.АдресПроведенияГолосования;
			ОбластьШапка.Параметры.ВопросГолосования = ТекущийДокумент.ВопросГолосования;
			ОбластьШапка.Параметры.Здание = ТекущийДокумент.Здание;
			ТабличныйДокумент.Вывести(ОбластьШапка);
					
			//Печать Область Шапка2
			ОбластьШапка2 = Макет.ПолучитьОбласть("Шапка2");
			ТабличныйДокумент.Вывести(ОбластьШапка2);
			
			//Печать область Строка
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			Для Каждого СтрокаУчасниковГолосования Из ТекущийДокумент.УчастникиГолосования Цикл
				ОбластьСтрока.Параметры.ОтветственныйВладелец = СтрокаУчасниковГолосования.ОтветственныйВладелец;
				ОбластьСтрока.Параметры.ЛицевойСчет = СтрокаУчасниковГолосования.ЛицевойСчет;
				ОбластьСтрока.Параметры.ОбъектЛицевогоСчета = СтрокаУчасниковГолосования.ЛицевойСчет.ОбъектЛицевогоСчета;
				ТабличныйДокумент.Вывести(ОбластьСтрока);
			КонецЦикла;
			
			//Печать область Подвал
			ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
			ТабличныйДокумент.Вывести(ОбластьПодвал);
			
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.Защита = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции
